# GetSelectedElements Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SelectionChangedEventArgs..::..GetSelectedElements Method
SelectionChangedEventArgs Class See Also
---
Returns ElementIds of selected elements.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public ISet<ElementId> GetSelectedElements()
```

Visual Basic
---
```text
Public Function GetSelectedElements As ISet(Of ElementId)
```

Visual C++
---
```text
public:
ISet<ElementId^>^ GetSelectedElements()
```

# See Also
SelectionChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace